Masmiseim36/nxpSDK/boards/evkmcimx7ulp/demo_apps/power_mode_switch/pin_mux.h
/* PTB7 (number AF6), BT_HOST_WAKE */
#define BOARD_INITPINS_BT_HOST_WAKE_PERIPHERAL                               PTB   /*!< Device name: PTB */
#define BOARD_INITPINS_BT_HOST_WAKE_SIGNAL                                  port   /*!< PTB signal: port */
#define BOARD_INITPINS_BT_HOST_WAKE_CHANNEL                                    7   /*!< PTB port channel: 7 */
#define BOARD_INITPINS_BT_HOST_WAKE_PIN_NAME                                PTB7   /*!< Pin name */
#define BOARD_INITPINS_BT_HOST_WAKE_PIN_FUNCTION_ID             IOMUXC_PTB7_PTB7   /*!< Pin function id */
#define BOARD_INITPINS_BT_HOST_WAKE_LABEL                         "BT_HOST_WAKE"   /*!< Label */
#define BOARD_INITPINS_BT_HOST_WAKE_NAME                          "BT_HOST_WAKE"   /*!< Identifier name */

/* PTB9 (number AD7), SEN_INT# */
#define BOARD_INITPINS_SEN_INT_PERIPHERAL                                    PTB   /*!< Device name: PTB */
#define BOARD_INITPINS_SEN_INT_SIGNAL                                       port   /*!< PTB signal: port */
#define BOARD_INITPINS_SEN_INT_CHANNEL                                         9   /*!< PTB port channel: 9 */
#define BOARD_INITPINS_SEN_INT_PIN_NAME                                     PTB9   /*!< Pin name */
#define BOARD_INITPINS_SEN_INT_PIN_FUNCTION_ID                  IOMUXC_PTB9_PTB9   /*!< Pin function id */
#define BOARD_INITPINS_SEN_INT_LABEL                                  "SEN_INT#"   /*!< Label */
#define BOARD_INITPINS_SEN_INT_NAME                                    "SEN_INT"   /*!< Identifier name */

/* PTB11 (number AB7), PMIC_INT# */
#define BOARD_INITPINS_PMIC_INT_PERIPHERAL                                   PTB   /*!< Device name: PTB */
#define BOARD_INITPINS_PMIC_INT_SIGNAL                                      port   /*!< PTB signal: port */
#define BOARD_INITPINS_PMIC_INT_CHANNEL                                       11   /*!< PTB port channel: 11 */
#define BOARD_INITPINS_PMIC_INT_PIN_NAME                                   PTB11   /*!< Pin name */
#define BOARD_INITPINS_PMIC_INT_PIN_FUNCTION_ID               IOMUXC_PTB11_PTB11   /*!< Pin function id */
#define BOARD_INITPINS_PMIC_INT_LABEL                                "PMIC_INT#"   /*!< Label */
#define BOARD_INITPINS_PMIC_INT_NAME                                  "PMIC_INT"   /*!< Identifier name */

/* PTB14 (number AG8), RTC_CLK */
#define BOARD_INITPINS_RTC_CLK_PERIPHERAL                                    RTC   /*!< Device name: RTC */
#define BOARD_INITPINS_RTC_CLK_SIGNAL                                 rtc_clkout   /*!< RTC signal: rtc_clkout */
#define BOARD_INITPINS_RTC_CLK_PIN_NAME                                    PTB14   /*!< Pin name */
#define BOARD_INITPINS_RTC_CLK_PIN_FUNCTION_ID           IOMUXC_PTB14_RTC_CLKOUT   /*!< Pin function id */
#define BOARD_INITPINS_RTC_CLK_LABEL                                   "RTC_CLK"   /*!< Label */
#define BOARD_INITPINS_RTC_CLK_NAME                                    "RTC_CLK"   /*!< Identifier name */

/* PTA25 (number AG20), A7_POW_EN# */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_PERIPHERAL                            PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_SIGNAL                               port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_CHANNEL                                25   /*!< PTA port channel: 25 */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_PIN_NAME                            PTA25   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_PIN_FUNCTION_ID        IOMUXC_PTA25_PTA25   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_LABEL                        "A7_POW_EN#"   /*!< Label */
#define BOARD_INITPINSNOQSPI_A7_POW_EN_NAME                          "A7_POW_EN"   /*!< Identifier name */

/* PTA19 (number AB19), UART0_RX */
#define BOARD_INITPINSNOQSPI_UART0_RX_PERIPHERAL                         LPUART0   /*!< Device name: LPUART0 */
#define BOARD_INITPINSNOQSPI_UART0_RX_SIGNAL                           lpuart_rx   /*!< LPUART0 signal: lpuart_rx */
#define BOARD_INITPINSNOQSPI_UART0_RX_PIN_NAME                             PTA19   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_UART0_RX_PIN_FUNCTION_ID    IOMUXC_PTA19_LPUART0_RX   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_UART0_RX_LABEL                           "UART0_RX"   /*!< Label */
#define BOARD_INITPINSNOQSPI_UART0_RX_NAME                            "UART0_RX"   /*!< Identifier name */

/* PTA18 (number AC19), UART0_TX */
#define BOARD_INITPINSNOQSPI_UART0_TX_PERIPHERAL                         LPUART0   /*!< Device name: LPUART0 */
#define BOARD_INITPINSNOQSPI_UART0_TX_SIGNAL                           lpuart_tx   /*!< LPUART0 signal: lpuart_tx */
#define BOARD_INITPINSNOQSPI_UART0_TX_PIN_NAME                             PTA18   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_UART0_TX_PIN_FUNCTION_ID    IOMUXC_PTA18_LPUART0_TX   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_UART0_TX_LABEL                           "UART0_TX"   /*!< Label */
#define BOARD_INITPINSNOQSPI_UART0_TX_NAME                            "UART0_TX"   /*!< Identifier name */

/* PTA4 (number AD15), I2S0_MCLK */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_PERIPHERAL                           I2S0   /*!< Device name: I2S0 */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_SIGNAL                           i2s_mclk   /*!< I2S0 signal: i2s_mclk */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_PIN_NAME                             PTA4   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_PIN_FUNCTION_ID     IOMUXC_PTA4_I2S0_MCLK   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_LABEL                         "I2S0_MCLK"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S0_MCLK_NAME                          "I2S0_MCLK"   /*!< Identifier name */

/* PTA2 (number AG14), I2S0_RXD0 */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_PERIPHERAL                           I2S0   /*!< Device name: I2S0 */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_SIGNAL                            i2s_rxd   /*!< I2S0 signal: i2s_rxd */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_CHANNEL                                 0   /*!< I2S0 i2s_rxd channel: 0 */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_PIN_NAME                             PTA2   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_PIN_FUNCTION_ID     IOMUXC_PTA2_I2S0_RXD0   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_LABEL                         "I2S0_RXD0"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S0_RXD0_NAME                          "I2S0_RXD0"   /*!< Identifier name */

/* PTA5 (number AC15), I2S0_TX_BCLK */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_PERIPHERAL                        I2S0   /*!< Device name: I2S0 */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_SIGNAL                     i2s_tx_bclk   /*!< I2S0 signal: i2s_tx_bclk */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_PIN_NAME                          PTA5   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_PIN_FUNCTION_ID IOMUXC_PTA5_I2S0_TX_BCLK /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_LABEL                   "I2S0_TX_BCLK"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S0_TX_BCLK_NAME                    "I2S0_TX_BCLK"   /*!< Identifier name */

