Masmiseim36/nxpSDK/boards/evkmcimx7ulp/demo_apps/power_mode_switch/pin_mux.h
/* PTA6 (number AB15), I2S0_TX_FS */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_PERIPHERAL                          I2S0   /*!< Device name: I2S0 */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_SIGNAL                         i2s_tx_fs   /*!< I2S0 signal: i2s_tx_fs */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_PIN_NAME                            PTA6   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_PIN_FUNCTION_ID   IOMUXC_PTA6_I2S0_TX_FS   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_LABEL                       "I2S0_TX_FS"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S0_TX_FS_NAME                        "I2S0_TX_FS"   /*!< Identifier name */

/* PTA7 (number AD14), I2S0_TXD0 */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_PERIPHERAL                           I2S0   /*!< Device name: I2S0 */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_SIGNAL                            i2s_txd   /*!< I2S0 signal: i2s_txd */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_CHANNEL                                 0   /*!< I2S0 i2s_txd channel: 0 */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_PIN_NAME                             PTA7   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_PIN_FUNCTION_ID     IOMUXC_PTA7_I2S0_TXD0   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_LABEL                         "I2S0_TXD0"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S0_TXD0_NAME                          "I2S0_TXD0"   /*!< Identifier name */

/* PTA3 (number AF14), VOL+ */
#define BOARD_INITPINSNOQSPI_VOL_UP_PERIPHERAL                               PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_VOL_UP_SIGNAL                                  port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_VOL_UP_CHANNEL                                    3   /*!< PTA port channel: 3 */
#define BOARD_INITPINSNOQSPI_VOL_UP_PIN_NAME                                PTA3   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_VOL_UP_PIN_FUNCTION_ID             IOMUXC_PTA3_PTA3   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_VOL_UP_LABEL                                 "VOL+"   /*!< Label */
#define BOARD_INITPINSNOQSPI_VOL_UP_NAME                                "VOL_UP"   /*!< Identifier name */

/* PTA13 (number AF16), VOL- */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_PERIPHERAL                             PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_SIGNAL                                port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_CHANNEL                                 13   /*!< PTA port channel: 13 */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_PIN_NAME                             PTA13   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_PIN_FUNCTION_ID         IOMUXC_PTA13_PTA13   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_LABEL                               "VOL-"   /*!< Label */
#define BOARD_INITPINSNOQSPI_VOL_DOWN_NAME                            "VOL_DOWN"   /*!< Identifier name */

/* PTA14 (number AF17), WL_REG_ON */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_PERIPHERAL                            PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_SIGNAL                               port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_CHANNEL                                14   /*!< PTA port channel: 14 */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_PIN_NAME                            PTA14   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_PIN_FUNCTION_ID        IOMUXC_PTA14_PTA14   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_LABEL                         "WL_REG_ON"   /*!< Label */
#define BOARD_INITPINSNOQSPI_WL_REG_ON_NAME                          "WL_REG_ON"   /*!< Identifier name */

/* PTA15 (number AF18), BT_REG_ON */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_PERIPHERAL                            PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_SIGNAL                               port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_CHANNEL                                15   /*!< PTA port channel: 15 */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_PIN_NAME                            PTA15   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_PIN_FUNCTION_ID        IOMUXC_PTA15_PTA15   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_LABEL                         "BT_REG_ON"   /*!< Label */
#define BOARD_INITPINSNOQSPI_BT_REG_ON_NAME                          "BT_REG_ON"   /*!< Identifier name */

/* PTA31 (number AF24), WL_HOST_WAKE */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_PERIPHERAL                         PTA   /*!< Device name: PTA */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_SIGNAL                            port   /*!< PTA signal: port */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_CHANNEL                             31   /*!< PTA port channel: 31 */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_PIN_NAME                         PTA31   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_PIN_FUNCTION_ID     IOMUXC_PTA31_PTA31   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_LABEL                   "WL_HOST_WAKE"   /*!< Label */
#define BOARD_INITPINSNOQSPI_WL_HOST_WAKE_NAME                    "WL_HOST_WAKE"   /*!< Identifier name */

/* PTB1 (number AF2), I2S1_TX_BCLK */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_PERIPHERAL                         PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_SIGNAL                            port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_CHANNEL                              1   /*!< PTB port channel: 1 */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_PIN_NAME                          PTB1   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_PIN_FUNCTION_ID       IOMUXC_PTB1_PTB1   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_LABEL                   "I2S1_TX_BCLK"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S1_TX_BCLK_NAME                    "I2S1_TX_BCLK"   /*!< Identifier name */

