Masmiseim36/nxpSDK/boards/evkmcimx7ulp/demo_apps/power_mode_switch/pin_mux.h
/* PTB2 (number AE3), I2S1_TX_FS */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_PERIPHERAL                           PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_SIGNAL                              port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_CHANNEL                                2   /*!< PTB port channel: 2 */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_PIN_NAME                            PTB2   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_PIN_FUNCTION_ID         IOMUXC_PTB2_PTB2   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_LABEL                       "I2S1_TX_FS"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S1_TX_FS_NAME                        "I2S1_TX_FS"   /*!< Identifier name */

/* PTB3 (number AE4), I2S1_TXD0 */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_PERIPHERAL                            PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_SIGNAL                               port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_CHANNEL                                 3   /*!< PTB port channel: 3 */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_PIN_NAME                             PTB3   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_PIN_FUNCTION_ID          IOMUXC_PTB3_PTB3   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_LABEL                         "I2S1_TXD0"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S1_TXD0_NAME                          "I2S1_TXD0"   /*!< Identifier name */

/* PTB10 (number AC7), I2S1_RXD0 */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_PERIPHERAL                            PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_SIGNAL                               port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_CHANNEL                                10   /*!< PTB port channel: 10 */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_PIN_NAME                            PTB10   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_PIN_FUNCTION_ID        IOMUXC_PTB10_PTB10   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_LABEL                         "I2S1_RXD0"   /*!< Label */
#define BOARD_INITPINSNOQSPI_I2S1_RXD0_NAME                          "I2S1_RXD0"   /*!< Identifier name */

/* PTB4 (number AG4), PTB4 */
#define BOARD_INITPINSNOQSPI_PTB4_PERIPHERAL                                 PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_PTB4_SIGNAL                                    port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_PTB4_CHANNEL                                      4   /*!< PTB port channel: 4 */
#define BOARD_INITPINSNOQSPI_PTB4_PIN_NAME                                  PTB4   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_PTB4_PIN_FUNCTION_ID               IOMUXC_PTB4_PTB4   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_PTB4_LABEL                                   "PTB4"   /*!< Label */
#define BOARD_INITPINSNOQSPI_PTB4_NAME                                    "PTB4"   /*!< Identifier name */

/* PTB5 (number AF4), PTB5 */
#define BOARD_INITPINSNOQSPI_PTB5_PERIPHERAL                                 PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_PTB5_SIGNAL                                    port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_PTB5_CHANNEL                                      5   /*!< PTB port channel: 5 */
#define BOARD_INITPINSNOQSPI_PTB5_PIN_NAME                                  PTB5   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_PTB5_PIN_FUNCTION_ID               IOMUXC_PTB5_PTB5   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_PTB5_LABEL                                   "PTB5"   /*!< Label */
#define BOARD_INITPINSNOQSPI_PTB5_NAME                                    "PTB5"   /*!< Identifier name */

/* PTB6 (number AF5), DDR_SW_EN# */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_PERIPHERAL                            PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_SIGNAL                               port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_CHANNEL                                 6   /*!< PTB port channel: 6 */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_PIN_NAME                             PTB6   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_PIN_FUNCTION_ID          IOMUXC_PTB6_PTB6   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_LABEL                        "DDR_SW_EN#"   /*!< Label */
#define BOARD_INITPINSNOQSPI_DDR_SW_EN_NAME                          "DDR_SW_EN"   /*!< Identifier name */

/* PTB7 (number AF6), BT_HOST_WAKE */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_PERIPHERAL                         PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_SIGNAL                            port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_CHANNEL                              7   /*!< PTB port channel: 7 */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_PIN_NAME                          PTB7   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_PIN_FUNCTION_ID       IOMUXC_PTB7_PTB7   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_LABEL                   "BT_HOST_WAKE"   /*!< Label */
#define BOARD_INITPINSNOQSPI_BT_HOST_WAKE_NAME                    "BT_HOST_WAKE"   /*!< Identifier name */

/* PTB9 (number AD7), SEN_INT# */
#define BOARD_INITPINSNOQSPI_SEN_INT_PERIPHERAL                              PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_SEN_INT_SIGNAL                                 port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_SEN_INT_CHANNEL                                   9   /*!< PTB port channel: 9 */
#define BOARD_INITPINSNOQSPI_SEN_INT_PIN_NAME                               PTB9   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_SEN_INT_PIN_FUNCTION_ID            IOMUXC_PTB9_PTB9   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_SEN_INT_LABEL                            "SEN_INT#"   /*!< Label */
#define BOARD_INITPINSNOQSPI_SEN_INT_NAME                              "SEN_INT"   /*!< Identifier name */

/* PTB11 (number AB7), PMIC_INT# */
#define BOARD_INITPINSNOQSPI_PMIC_INT_PERIPHERAL                             PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_PMIC_INT_SIGNAL                                port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_PMIC_INT_CHANNEL                                 11   /*!< PTB port channel: 11 */
#define BOARD_INITPINSNOQSPI_PMIC_INT_PIN_NAME                             PTB11   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_PMIC_INT_PIN_FUNCTION_ID         IOMUXC_PTB11_PTB11   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_PMIC_INT_LABEL                          "PMIC_INT#"   /*!< Label */
#define BOARD_INITPINSNOQSPI_PMIC_INT_NAME                            "PMIC_INT"   /*!< Identifier name */

/* PTB14 (number AG8), RTC_CLK */
#define BOARD_INITPINSNOQSPI_RTC_CLK_PERIPHERAL                              RTC   /*!< Device name: RTC */
#define BOARD_INITPINSNOQSPI_RTC_CLK_SIGNAL                           rtc_clkout   /*!< RTC signal: rtc_clkout */
#define BOARD_INITPINSNOQSPI_RTC_CLK_PIN_NAME                              PTB14   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_RTC_CLK_PIN_FUNCTION_ID     IOMUXC_PTB14_RTC_CLKOUT   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_RTC_CLK_LABEL                             "RTC_CLK"   /*!< Label */
#define BOARD_INITPINSNOQSPI_RTC_CLK_NAME                              "RTC_CLK"   /*!< Identifier name */

/* PTB8 (number AG6), QSPIA_SS0_B */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_PERIPHERAL                          PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_SIGNAL                             port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_CHANNEL                               8   /*!< PTB port channel: 8 */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_PIN_NAME                           PTB8   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_PIN_FUNCTION_ID        IOMUXC_PTB8_PTB8   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_LABEL                     "QSPIA_SS0_B"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_SS0_B_NAME                      "QSPIA_SS0_B"   /*!< Identifier name */

/* PTB15 (number AF8), QSPIA_SCLK */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_PERIPHERAL                           PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_SIGNAL                              port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_CHANNEL                               15   /*!< PTB port channel: 15 */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_PIN_NAME                           PTB15   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_PIN_FUNCTION_ID       IOMUXC_PTB15_PTB15   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_LABEL                       "QSPIA_SCLK"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_SCLK_NAME                        "QSPIA_SCLK"   /*!< Identifier name */

/* PTB16 (number AF9), QSPIA_DATA3 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_PERIPHERAL                          PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_SIGNAL                             port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_CHANNEL                              16   /*!< PTB port channel: 16 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_PIN_NAME                          PTB16   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_PIN_FUNCTION_ID      IOMUXC_PTB16_PTB16   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_LABEL                     "QSPIA_DATA3"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA3_NAME                      "QSPIA_DATA3"   /*!< Identifier name */

/* PTB17 (number AF10), QSPIA_DATA2 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_PERIPHERAL                          PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_SIGNAL                             port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_CHANNEL                              17   /*!< PTB port channel: 17 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_PIN_NAME                          PTB17   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_PIN_FUNCTION_ID      IOMUXC_PTB17_PTB17   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_LABEL                     "QSPIA_DATA2"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA2_NAME                      "QSPIA_DATA2"   /*!< Identifier name */

/* PTB18 (number AG10), QSPIA_DATA1 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_PERIPHERAL                          PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_SIGNAL                             port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_CHANNEL                              18   /*!< PTB port channel: 18 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_PIN_NAME                          PTB18   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_PIN_FUNCTION_ID      IOMUXC_PTB18_PTB18   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_LABEL                     "QSPIA_DATA1"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA1_NAME                      "QSPIA_DATA1"   /*!< Identifier name */

