Masmiseim36/nxpSDK/boards/evkmcimx7ulp/demo_apps/power_mode_switch/pin_mux.h
/* PTB19 (number AD10), QSPIA_DATA0 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_PERIPHERAL                          PTB   /*!< Device name: PTB */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_SIGNAL                             port   /*!< PTB signal: port */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_CHANNEL                              19   /*!< PTB port channel: 19 */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_PIN_NAME                          PTB19   /*!< Pin name */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_PIN_FUNCTION_ID      IOMUXC_PTB19_PTB19   /*!< Pin function id */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_LABEL                     "QSPIA_DATA0"   /*!< Label */
#define BOARD_INITPINSNOQSPI_QSPIA_DATA0_NAME                      "QSPIA_DATA0"   /*!< Identifier name */

/* PTA16 (number AG18), I2C0_SCL */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_PERIPHERAL                       LPI2C0   /*!< Device name: LPI2C0 */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_SIGNAL                        lpi2c_scl   /*!< LPI2C0 signal: lpi2c_scl */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_PIN_NAME                          PTA16   /*!< Pin name */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_PIN_FUNCTION_ID IOMUXC_PTA16_LPI2C0_SCL   /*!< Pin function id */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_LABEL                        "I2C0_SCL"   /*!< Label */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SCL_NAME                         "I2C0_SCL"   /*!< Identifier name */

/* PTA17 (number AD19), I2C0_SDA */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_PERIPHERAL                       LPI2C0   /*!< Device name: LPI2C0 */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_SIGNAL                        lpi2c_sda   /*!< LPI2C0 signal: lpi2c_sda */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_PIN_NAME                          PTA17   /*!< Pin name */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_PIN_FUNCTION_ID IOMUXC_PTA17_LPI2C0_SDA   /*!< Pin function id */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_LABEL                        "I2C0_SDA"   /*!< Label */
#define BOARD_I2C_CONFIGUREPINS_I2C0_SDA_NAME                         "I2C0_SDA"   /*!< Identifier name */

/* PTB12 (number AC8), I2C3_SCL */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_PERIPHERAL                       LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_SIGNAL                        lpi2c_scl   /*!< LPI2C3 signal: lpi2c_scl */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_PIN_NAME                          PTB12   /*!< Pin name */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_PIN_FUNCTION_ID IOMUXC_PTB12_LPI2C3_SCL   /*!< Pin function id */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_LABEL                        "I2C3_SCL"   /*!< Label */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SCL_NAME                         "I2C3_SCL"   /*!< Identifier name */

/* PTB13 (number AD8), I2C3_SDA */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_PERIPHERAL                       LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_SIGNAL                        lpi2c_sda   /*!< LPI2C3 signal: lpi2c_sda */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_PIN_NAME                          PTB13   /*!< Pin name */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_PIN_FUNCTION_ID IOMUXC_PTB13_LPI2C3_SDA   /*!< Pin function id */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_LABEL                        "I2C3_SDA"   /*!< Label */
#define BOARD_I2C_CONFIGUREPINS_I2C3_SDA_NAME                         "I2C3_SDA"   /*!< Identifier name */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsNoQSPI(void);                           /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);                        /*!< Function assigned for the core: Cortex-M4[cm4] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
